[
  {
    "id": "tcp-bbr-deep-dive",
    "title": "TCP BBR: From v1 to v3 and its Implementation in Linux",
    "date": "2025-11-01",
    "file": "tcp_bbr.md",
    "excerpt": "TCP BBR (Bottleneck Bandwidth and Round-trip propagation time) is an innovative TCP congestion control algorithm from Google that takes a fundamentally different approach from traditional loss-based algorithms. This article provides a deep dive into the core principles of BBR, its evolution from v1 to v3, and provides a detailed guide on how to apply it on Linux systems, including its advantages and disadvantages.",
    "tags": [
      "TCP",
      "BBR",
      "Congestion Control",
      "Networking",
      "Linux",
      "Performance"
    ],
    "readingTime": "📖 18 min read"
  },
  {
    "id": "postgresql-architecture-overview",
    "title": "A High-Level Overview of PostgreSQL's Architecture",
    "date": "2025-10-18",
    "file": "postgresql_overview.md",
    "excerpt": "Get a high-level overview of PostgreSQL's internal workings. This post covers key architectural concepts, data storage models, and the mechanisms that ensure data integrity and performance, making it a reliable choice for applications of all sizes.",
    "tags": ["PostgreSQL", "Database", "RDBMS", "MVCC", "WAL", "Architecture"],
    "readingTime": "📖 9 min read"
  },
  {
    "id": "python-api-frameworks-hidden-gems",
    "title": "Hidden Gems of Python API Frameworks: An In-Depth Analysis of Granian, Falcon and Tornado",
    "date": "2025-10-17",
    "file": "py_api_frameworks.md",
    "excerpt": "Are you looking for solutions optimized for extreme performance and specific architectures beyond FastAPI, Flask, and DRF? This article delves deep into the philosophy, strengths, and architecture of hidden gem-like frameworks Granian, Falcon and Tornado that have been overshadowed by the mainstream.",
    "tags": [
      "Python",
      "HTTP",
      "API",
      "Framework",
      "Granian",
      "Falcon",
      "Tornado"
    ],
    "readingTime": "📖 18 min read"
  },
  {
    "id": "python-3-15-pep-preview",
    "title": "Python 3.15 Preview and CPython Evolution: PEP 799, PEP 782, and the Era of Free-threading",
    "date": "2025-10-16",
    "file": "py_3_15_pep.md",
    "excerpt": "From Python 3.13 to 3.15, CPython is undergoing innovative changes to overcome the limitations of performance and concurrency. Experimental features such as GIL removal (Free-threading), JIT compiler, and sub-interpreters are becoming a reality, PEP 799 systematizes profiling tools, and PEP 782 strengthens the safety of the C API. Let's take a look at Python's journey of evolving into a high-performance language.",
    "tags": [
      "Python",
      "CPython",
      "PEP",
      "Performance",
      "Free-threading",
      "JIT",
      "Profiling"
    ],
    "readingTime": "📖 8 min read"
  },
  {
    "id": "fastapi-cloud-expectations",
    "title": "Expectations for FastAPI Cloud",
    "date": "2025-10-16",
    "file": "fastapi_cloud_expectations.md",
    "excerpt": "'FastAPI Cloud' has emerged to dramatically simplify FastAPI application deployment. Based on the official website information, we summarize the expectations for the changes that will be brought by the 'You code. We cloud.' vision and the 'zero configuration, zero uncertainty, zero frustration' philosophy, where developers focus only on code and leave cloud infrastructure management to the platform.",
    "tags": ["FastAPI", "Cloud", "PaaS", "Deployment", "DX"],
    "readingTime": "📖 6 min read"
  },
  {
    "id": "ai-agent-framework-guide",
    "title": "Production-Ready AI Agent Frameworks: An In-Depth Analysis of 7 Major Frameworks",
    "date": "2025-10-15",
    "file": "ai_agent_framework_guide.md",
    "excerpt": "We have entered the era of 'agents' where AI goes beyond simple information generation to autonomously perform complex tasks. This article provides an in-depth comparative analysis of seven major AI agent frameworks: CrewAI, Microsoft Agent Framework, OpenAI Agents SDK, Google ADK, Claude Agent SDK, Pydantic AI, and LangGraph.",
    "tags": [
      "AI",
      "AI Agent",
      "Framework",
      "CrewAI",
      "Microsoft Agent Framework",
      "OpenAI",
      "Google ADK",
      "Claude",
      "Pydantic AI",
      "LangGraph"
    ],
    "readingTime": "📖 35 min read"
  }
]
